Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This does not preclude HTTP from being implemented on top of any other protocol on the Internet, or on other networks.
zh_cn: 这并不妨碍 HTTP 在 Internet 上或其他网络上的任何其他协议之上实现。

source: This does not preclude HTTP/TLS from being run over another transport.
zh_cn: 这并不妨碍 HTTP/TLS 在另一个传输上运行。

source: This draft updates the TLS 1.2 specification to deprecate support for MD5 and SHA-1 for digital signatures.
zh_cn: 该草案更新了 TLS 1.2 规范，以弃用对数字签名的 MD5 和 SHA-1 的支持。

source: This element of the state may be null.
zh_cn: 该状态的元素可以为 null。

source: This example flow squares the numbers from 1 to 10 on the **computation** `Scheduler` and consumes the results on the "main" thread (more precisely, the caller thread of `blockingSubscribe`).
zh_cn: 这个示例流在 **computation** `Scheduler` 上将数字 1 到 10 计算平方，并在 "main" 线程上消费结果(更确切地说，是 `blockingSubscribe` 的调用者线程)。

source: This exception, the purpose of which is to minimize any client processing delays associated with an undeclared wait for 100 (Continue) status, applies only to HTTP/1.1 requests, and not to requests with any other HTTP- version value.
zh_cn: 此异常的目的是最小化与未声明等待 100(继续)状态相关联的任何客户端处理延迟，仅适用于 HTTP/1.1 请求，而不适用于具有任何其他 HTTP 版本值的请求。

source: This extension also restricts the modes for use with PSK resumption.
zh_cn: 此扩展还限制了 PSK 恢复使用的模式。

source: This extension was also used to negotiate ECDSA curves.
zh_cn: 此扩展也用于协商 ECDSA 曲线。

source: This extension, if provided by the server, MUST only be sent in the CertificateRequest message.
zh_cn: 此扩展(如果由服务器提供)必须仅在 CertificateRequest 消息中发送。

source: This fallback chain SHOULD NOT use the deprecated SHA-1 hash algorithm in general, but MAY do so if the client's advertisement permits it, and MUST NOT do so otherwise.
zh_cn: 这个回退链通常不应该使用弃用的 SHA-1 哈希算法，但如果客户端的公告允许，可以这样做，否则不得这样做。

source: This feature is designed to prevent rollback attacks.
zh_cn: 此功能旨在防止回滚攻击。

source: This field SHALL be zero length unless used for the post-handshake authentication exchanges described in Section 4.6.2.
zh_cn: 除非用于第 4.6.2 节中描述的握手后认证交换，否则该字段应为零长度。

source: This field communicates the current value of the urgent pointer as a positive offset from the sequence number in this segment.
zh_cn: 该字段将紧急指针的当前值传递为该报文段中序列号的正偏移量。

source: This field indicates the hash algorithm which may be used.
zh_cn: 该字段表示可以使用的散列算法。

source: This field indicates the signature algorithm that may be used.
zh_cn: 该字段表示可以使用的签名算法。

source: This field is deprecated and MUST be ignored for all purposes.
zh_cn: 该字段已弃用，必须为所有目的忽略。

source: This field is empty if no session_id is available, or if the client wishes to generate new security parameters.
zh_cn: 如果没有 session_id 可用，或者客户端希望生成新的安全参数，则此字段为空。

source: This field is only be interpreted in segments with the URG control bit set.
zh_cn: 该字段仅在设置了 URG 控制位的报文段中进行解释。

source: This field will contain the lower of that suggested by the client in the client hello and the highest supported by the server.
zh_cn: 此字段将包含客户端 hello 中客户端建议的较低值和服务器支持的最高值。

source: This flexibility regarding line breaks applies only to text media in the entity-body; a bare CR or LF MUST NOT be substituted for CRLF within any of the HTTP control structures (such as header fields and multipart boundaries).
zh_cn: 关于换行的这种灵活性仅适用于实体主体中的文本媒体；在任何 HTTP 控制结构(例如首部字段和多部分边界)内，绝不能用 CR 或 LF 代替 CRLF。

source: This format is a Lempel-Ziv coding (LZ77) with a 32 bit CRC.
zh_cn: 该格式是具有 32 位 CRC 的 Lempel-Ziv 编码(LZ77)。

source: This format is an adaptive Lempel-Ziv-Welch coding (LZW).
zh_cn: 该格式是自适应 Lempel-Ziv-Welch 编码(LZW)。

source: This gives the TCP protection against misrouted segments.
zh_cn: 这为 TCP 提供了针对错误路由的报文段的保护。

source: This handler can be overridden with the method `RxJavaPlugins.setErrorHandler(Consumer<Throwable>)`.
zh_cn: 可以使用方法 `RxJavaPlugins.setErrorHandler(Consumer<Throwable>)` 覆盖此处理程序。

source: This handshake is being canceled for some reason unrelated to a protocol failure.
zh_cn: 由于与协议故障无关的某些原因，此握手被取消。

source: This has the benefits of providing the user agent a resource identifier and transferring the representation via a method more amenable to shared caching, though at the cost of an extra request if the user agent does not already have the representation cached.
zh_cn: 这具有以下优点：向用户代理提供资源标识符并通过更适合于共享缓存的方法来传送表示，但是如果用户代理尚未具有缓存的表示，则以额外请求为代价。

source: This has the consequence that even a backpressure-supporting source such as `range` will be completely realized.
zh_cn: 这样的结果是，即使是一个支持背压的源，如 `range` ，也将完全 realized。（译注：不知道怎么译）

source: This includes all existing cipher suites.
zh_cn: 这包括所有现有的加密套件。

source: This increases compatibility with existing servers that incorrectly implemented version negotiation.
zh_cn: 这增加了与错误实现版本协商的现有服务器的兼容性。

source: This indicates a resumed session and dictates that the parties must proceed directly to the Finished messages.
zh_cn: 这表示恢复会话并指示各方必须直接进入 Finished 消息。

source: This indicates where the data begins.
zh_cn: 这表示数据的起始位置。

source: This indication is not required, however, because any recipient on the response chain (including the origin server) can remove transfer codings when they are not needed.
zh_cn: 但是，此指示不是必需的，因为响应链上的任何接收者(包括源服务器)都可以在不需要时删除传输编码。

source: This information is carried in the Internet Protocol and is transferred across the TCP/Network interface in the arguments or results of calls by the TCP on the IP.
zh_cn: 此信息在 IP 协议中承载，并通过 TCP / 网络接口在 IP 上的 TCP 调用的参数或结果中传输。

source: This interface is lightweight and combines request management with cancellation into a single interface `org.reactivestreams.Subscription` instead of having `rx.Producer` and `rx.Subscription` separately.
zh_cn: 这个接口是轻量级的，它将请求管理和取消组合到单个接口 `org.reactivestreams.Subscription` 中，而不是单独使用 `rx.Producer` 和 `rx.Subscription`。

source: This is a bounded version that signals `BufferOverflowError`in case its buffer reaches the given capacity.
zh_cn: 这是一个有界版本，在其缓冲区达到给定容量的情况下发出 `BufferOverflowError` 信号。

source: This is a change from TLS 1.0 to conform with widespread implementation practice.
zh_cn: 这是从 TLS 1.0 的变化，以符合广泛的实现实践。

source: This is a departure from TLS 1.1, which required that the algorithms be the same.
zh_cn: 这与 TLS 1.1 不同，后者要求算法相同。

source: This is a fatal error.
zh_cn: 这是一个致命的错误。

source: This is a large convenience for consumers and mappers that otherwise throw and would need `try-catch` to transform or suppress a checked exception.
zh_cn: 这对于消费者和映射器来说是一个很大的便利，否则会抛出并且需要 `try-catch` 来转换或抑制检查型异常。

source: This is a list of the compression methods supported by the client, sorted by client preference.
zh_cn: 这是客户端支持的压缩方法列表，按客户端偏好排序。

source: This is a list of the cryptographic options supported by the client, with the client's first preference first.
zh_cn: 这是客户端支持的加密选项列表，首先是客户端的最偏好项。

source: This is a particular issue for RSA keys and PSS signatures, as described below.
zh_cn: 这是 RSA 密钥和 PSS 签名的特殊问题，如下所述。

source: This is a sequence (chain) of certificates.
zh_cn: 这是证书的序列(链)。

source: This is a simple way of including useful notes in parallel with the specifications.
zh_cn: 这是一种与规范并行包含有用注释的简单方法。

source: This is a temporary state when `subscribe()` is called on a flow that establishes the chain of processing steps internally:
zh_cn: 当在内部建立处理步骤链的流上调用 `subscribe()` 时，这是一个临时状态：

source: This is achieved by implicitly including some control flags in the sequence space so they can be retransmitted and acknowledged without confusion (i.e., one and only one copy of the control will be acted upon).
zh_cn: 这是通过在序列空间中隐含地包括一些控制标志来实现的，这样它们可以被重传和确认而不会混淆(即，控制位的一个且仅一个副本将被作用)。

source: This is an Internet Standards Track document.
zh_cn: 这是一个互联网标准跟踪文档。

source: This is an engineering choice, and may be changed if experience indicates it is desirable to do so.
zh_cn: 这是一种工程选择，如果经验表明需要这样做，可能会改变。

source: This is done in an exchange of connection establishing segments carrying a control bit called "SYN" (for synchronize) and the initial sequence numbers.
zh_cn: 这是在交换连接建立报文段间完成的，该报文段带有称为“SYN”(表示 synchronize)的控制位和初始序列号。

source: This is especially relevant if the data is authenticated either with TLS client authentication or inside the application protocol.
zh_cn: 如果数据通过 TLS 客户端身份验证或在应用程序协议内进行身份验证，则这尤其重要。

source: This is illustrated in figure 11.
zh_cn: 这在图 11 中说明。

source: This is indicated in the first two formats by the inclusion of "GMT" as the three-letter abbreviation for time zone, and MUST be assumed when reading the asctime format.
zh_cn: 前两种格式通过包含“GMT”作为时区的三字母缩写来表示，并且在读取 asctime 格式时必须假设。

source: This is not guaranteed to happen immediately, however, and it is possible for an Observable to generate and attempt to emit items for a while even after no observers remain to observe these emissions.
zh_cn: 但是，这并不能保证立即发生，即使在没有观察者观察这些发射之后，Observable 也有可能在一段时间内产生并尝试发射数据项。

source: This is not recommended; it would be more appropriate to define a new version of TLS -- particularly since the TLS handshake algorithms have specific protection against version rollback attacks based on the version number, and the possibility of version rollback should be a significant consideration in any major design change.
zh_cn: 不推荐这样做；定义新版本的 TLS 会更合适 - 特别是因为 TLS 握手算法具有基于版本号的版本回滚攻击的特定保护，并且版本回滚的可能性应该是任何主要设计更改中的重要考虑因素。

source: This is often more apparent when each element is written on a separate line:
zh_cn: 当每个元素写在一个单独的行上时，这通常更明显：

source: This is only data visible at the handshake layer and does not include record layer headers.
zh_cn: 这只是在握手层可见的数据，不包括记录层首部。

source: This is primarily useful for non-connection-oriented transports (see [RFC6347] for an example of this).
zh_cn: 这对于非面向连接的传输非常有用(有关此示例，请参阅 [RFC6347])。

source: This is principally useful for reserving regions of the space.
zh_cn: 这主要用于保留空间区域。

source: This is similar to their role within some operating systems' file directory structures to indicate the current directory and parent directory, respectively.
zh_cn: 这类似于它们在某些操作系统的文件目录结构中的作用，分别表示当前目录和父目录。

source: This is sometimes called **continuations** and, depending on what should happen and what types are involved, may involve various operators to accomplish.
zh_cn: 这有时被称为 **continuations** ，并且取决于应该发生什么以及涉及什么类型，可能涉及各种操作符来完成。

source: This is somewhat inelegant but is a compromise designed to minimize changes to the original cipher suite design.
zh_cn: 这有点不优雅，但是旨在最小化对原始加密套件设计的更改的折衷方案。

source: This is the concatenation of all the Handshake structures (as defined in Section 7.4) exchanged thus far.
zh_cn: 这是迄今为止交换的所有握手结构(定义见第 7.4 节)的串联。

source: This is the concatenation of all the Handshake structures as defined in Section 7.4, exchanged thus far.
zh_cn: 这是第 7.4 节中定义的，迄今为止已交换的所有握手结构的串联。

source: This is the first message that is encrypted under keys derived from the server_handshake_traffic_secret.
zh_cn: 这是在 server_handshake_traffic_secret 派生的密钥下加密的第一条消息。

source: This is the first message the client can send after receiving a ServerHelloDone message.
zh_cn: 这是客户端在收到 ServerHelloDone 消息后可以发送的第一条消息。

source: This is the identity of the session corresponding to this connection.
zh_cn: 这是与此连接对应的会话的标识。

source: This is the only place where square bracket characters are allowed in the URI syntax.
zh_cn: 这是 URI 语法中唯一允许使用方括号字符的位置。

source: This is the state when the flows are actively emitting items, errors or completion signals:
zh_cn: 这是流主动发出项目，错误或完成信号时的状态：

source: This is the true power of lazily evaluating and computing inside `Flowable`s.
zh_cn: 这是 `Flowable` 内部的懒评估和计算的真正力量。

source: This is true for the following key exchange methods:
zh_cn: 这适用于以下密钥交换方法：

source: This is typically because such services are implemented via a gateway that requires a content-length in advance of being called and the server is unable or unwilling to buffer the entire request before processing.
zh_cn: 这通常是因为这样的服务是通过网关实现的，该网关在被调用之前需要内容长度并且服务器在处理之前不能或不愿意缓冲整个请求。

source: This is used to detect version rollback attacks.
zh_cn: 这用于检测版本回滚攻击。

source: This is very important because now any operation you can perform on an Iterable, you can also perform on an Observable.
zh_cn: 这非常重要，因为现在您可以在 Iterable 上执行的任何操作，都可以在 Observable 上执行。

source: This is when the **subscription side-effects** are triggered (see `doOnSubscribe`).
zh_cn: 这是 **subscription side-effects (订阅副作用)** 的触发时机(参见 `doOnSubscribe`)。

source: This leaves a small timing channel, since MAC performance depends to some extent on the size of the data fragment, but it is not believed to be large enough to be exploitable, due to the large block size of existing MACs and the small size of the timing signal.
zh_cn: 这就留下了一个小的定时信道，因为 MAC 性能在一定程度上取决于数据片段的大小，但是由于现有 MAC 的块大小和定时信号的大小，人们认为它不够大，无法被利用。

source: This length specifies the length of the padding field exclusive of the padding_length field itself.
zh_cn: 此长度指定填充字段的长度，不包括 padding_length 字段本身。

source: This limit is derived from the maximum TLSInnerPlaintext length of 2^14 octets + 1 octet for ContentType + the maximum AEAD expansion of 255 octets.
zh_cn: 此限制源自 ContentType 的最大 TLSInnerPlaintext 长度 2 ^ 14 个八位字节+ 1 个八位字节+ 255 个八位字节的最大 AEAD 扩展。

source: This may be different from handshake_messages in Section 7.4.8 because it would include the CertificateVerify message (if sent).
zh_cn: 这可能不同于第 7.4.8 节中的 handshake_messages，因为它将包括 CertificateVerify 消息(如果发送)。

source: This means errors that can't be emitted because the downstream's lifecycle already reached its terminal state or the downstream cancelled a sequence which was about to emit an error.
zh_cn: 这意味着无法发出的错误，因为下游的生命周期已达到其终端状态，或者下游取消了将要发出错误的序列。

source: This means that `Observable<Void>` can no longer emit any values but only terminate normally or with an exception.
zh_cn: 这意味着 `Observable<Void>` 不能再发出任何值，只能正常终止或带异常终止。

source: This means that an invocation of `onSubscribe(Disposable)` is potentially followed by one of the other `onXXX` methods.
zh_cn: 这意味着 `onSubscribe(Disposable)` 的调用可能跟随其他 `onXXX` 方法之一。

source: This means that clients, servers, and proxies MUST be able to recover from asynchronous close events.
zh_cn: 这意味着客户端，服务器和代理必须能够从异步关闭事件中恢复。

source: This mechanism allows for straight-forward duplicate detection in the presence of retransmission.
zh_cn: 该机制允许在存在重传的情况下进行直接重复检测。

source: This mechanism provides limited protection against downgrade attacks over and above what is provided by the Finished exchange: because the ServerKeyExchange, a message present in TLS 1.2 and below, includes a signature over both random values, it is not possible for an active attacker to modify the random values without detection as long as ephemeral ciphers are used.
zh_cn: 此机制提供有限的保护，防止降级攻击超过完成交换所提供的范围：因为 ServerKeyExchange(TLS 1.2 及更低版本中存在的消息)包含两个随机值的签名，因此主动攻击者无法修改只要使用短暂密码，就可以不检测随机值。

source: This media type UST NOT be used unless the sender knows that the recipient can arse it; the presence in a request of a Range header with ultiple byte- range specifiers from a 1.1 client implies that the lient can parse multipart/byteranges responses.
zh_cn: 除非知道收件人可以解析，否则不得使用此媒体类型;在具有来自 1.1 客户端的多个字节范围说明符的 Range 首部的请求中的存在意味着客户端可以解析 multipart/byteranges 响应。

source: This memo describes how to use TLS to secure HTTP connections over the Internet.
zh_cn: 本备忘录描述了如何使用 TLS 来保护互联网上的 HTTP 连接。

source: This memo provides information for the Internet community.
zh_cn: 本备忘录为互联网社区提供信息。

source: This message MAY be ignored by the client if it does not wish to renegotiate a session, or the client may, if it wishes, respond with a no_renegotiation alert.
zh_cn: 如果客户端不希望重新协商会话，则可以忽略此消息，或者如果客户希望，客户端可以使用 no_renegotiation 警报进行响应。

source: This message MUST NOT be included in the message hashes that are maintained throughout the handshake and used in the Finished messages and the certificate verify message.
zh_cn: 此消息不得包含在整个握手过程中维护，并在 Finished 消息和证书验证消息中使用的消息散列中。

source: This message conveys cryptographic information to allow the client to communicate the premaster secret: a Diffie-Hellman public key with which the client can complete a key exchange (with the result being the premaster secret) or a public key for some other algorithm.
zh_cn: 此消息传达加密信息以允许客户端传送预主密钥：Diffie-Hellman 公钥，客户端可以使用该公钥完成密钥交换(结果是预主密钥)或某个其他算法的公钥。

source: This message conveys the client's certificate chain to the server;
zh_cn: 此消息将客户端的证书链传送到服务器；

source: This message conveys the endpoint's certificate chain to the peer.
zh_cn: 此消息将端点的证书链传送给对等端。

source: This message conveys the server's certificate chain to the client.
zh_cn: 此消息将服务器的证书链传送给客户端。

source: This message indicates that all 0-RTT application_data messages, if any, have been transmitted and that the following records are protected under handshake traffic keys.
zh_cn: 此消息表示已发送所有 0-RTT application_data 消息(如果有)，并且以下记录在握手通信密钥下受到保护。

source: This message is always a warning.
zh_cn: 此消息始终是警告。

source: This message is always fatal and should never be observed in communication between proper implementations
zh_cn: 此消息始终是致命的，在正确实现之间的通信中永远不应该被观察到

source: This message is always fatal and should never be observed in communication between proper implementations (except when messages were corrupted in the network).
zh_cn: 此消息始终是致命的，在正确实现之间的通信中永远不应该被观察到(除非消息在网络中被破坏)。

source: This message is always fatal and should never be observed in communication between proper implementations.
zh_cn: 此消息始终是致命的，在正确实现之间的通信中永远不应该被观察到。

source: This message is always fatal.
zh_cn: 这条消息总是致命的。

source: This message is always sent by the client.
zh_cn: 此消息始终由客户端发送。

source: This message is encrypted under keys derived from the client_early_traffic_secret.
zh_cn: 此消息在从 client_early_traffic_secret 派生的密钥下加密。

source: This message is generally a warning.
zh_cn: 此消息通常是一个警告。

source: This message is not intended to establish which side is the client or server but merely to initiate a new negotiation.
zh_cn: 此消息并非旨在确定哪一方是客户端或服务器，而只是为了启动新的协商。

source: This message is omitted by the server if not authenticating with a certificate and by the client if the server did not send CertificateRequest (thus indicating that the client should not authenticate with a certificate).
zh_cn: 如果未使用证书进行身份验证，则服务器将忽略此消息；如果服务器未发送 CertificateRequest，则由客户端忽略此消息(从而指示客户端不应使用证书进行身份验证)。

source: This message is omitted if client authentication is not desired.
zh_cn: 如果不需要客户端身份验证，则会省略此消息。

source: This message is omitted if the endpoint is not authenticating via a certificate.
zh_cn: 如果端点未通过证书进行身份验证，则会忽略此消息。

source: This message is only sent following a client certificate that has signing capability (i.e., all certificates except those containing fixed Diffie-Hellman parameters).
zh_cn: 这个消息仅跟随有签署能力的客户端证书发送(即，除了那些含有固定的 Diffie-Hellman 参数的所有证书)。

source: This message is only sent if the server requests a certificate.
zh_cn: 仅当服务器请求证书时才会发送此消息。

source: This message is used to provide explicit proof that an endpoint possesses the private key corresponding to its certificate.
zh_cn: 此消息用于提供明确证据表明端点拥有与其证书对应的私钥。

source: This message is used to provide explicit verification of a client certificate.
zh_cn: 此消息被用来提供客户端证书的明确验证。

source: This message means that the server is done sending messages to support the key exchange, and the client can proceed with its phase of the key exchange.
zh_cn: 此消息表示服务器已完成发送消息以支持密钥交换，并且客户端可以继续其密钥交换的阶段。

source: This message notifies the recipient that the sender will not send any more messages on this connection.
zh_cn: 此消息通知接收者，发送者不会再在此连接上发送任何消息。

source: This message provides key confirmation, binds the endpoint's identity to the exchanged keys, and in PSK mode also authenticates the handshake.
zh_cn: 此消息提供密钥确认，将端点的标识绑定到交换的密钥，在 PSK 模式下也验证握手。

source: This message will always immediately follow the ServerHello message.
zh_cn: 此消息将始终紧跟在 ServerHello 消息之后。

source: This message will be encrypted with the 0-RTT traffic keys.
zh_cn: 此消息将使用 0-RTT 通信密钥进行加密。

source: This message will be ignored by the client if the client is currently negotiating a session.
zh_cn: 如果客户端当前正在协商会话，则客户端将忽略此消息。

source: This message will be sent immediately after the server Certificate message (or the ServerHello message, if this is an anonymous negotiation).
zh_cn: 此消息将在服务器 Certificate 消息(或 ServerHello 消息，如果这是匿名协商)之后立即发送。

source: This message, if sent, MUST follow EncryptedExtensions.
zh_cn: 此消息，如果发送，必须遵循 EncryptedExtensions。

source: This message, if sent, will immediately follow the ServerKeyExchange message (if it is sent; otherwise, this message follows the server's Certificate message).
zh_cn: 此消息（如果已发送）将紧跟 ServerKeyExchange 消息（如果其已发送；否则，此消息将在服务器的 Certificate 消息之后）。

source: This method MAY be overridden by human intervention (or other means) on the origin server.
zh_cn: 可以通过源服务器上的人为干预(或其他方式)覆盖此方法。

source: This method allows a client to determine the options and/or requirements associated with a resource, or the capabilities of a server, without implying a resource action.
zh_cn: 该方法允许客户端确定与资源相关联的选项和/或要求，或服务器的能力，而不暗示资源动作。

source: This method allows the client to determine the options and/or requirements associated with a resource, or the capabilities of a server, without implying a resource action or initiating a resource retrieval.
zh_cn: 该方法允许客户端确定与资源相关联的选项和/或要求，或服务器的能力，而不暗示资源动作或启动资源检索。

source: This method can be used for obtaining metadata about the selected representation without transferring the representation data and is often used for testing hypertext links for validity, accessibility, and recent modification.
zh_cn: 该方法可用于获得关于所选表示的元数据而不传送表示数据，并且通常用于测试超文本链接的有效性，可访问性和最近修改。

source: This method can be used for obtaining metainformation about the entity implied by the request without transferring the entity-body itself.
zh_cn: 该方法可用于获得关于请求所暗示的实体的元信息，而无需传输实体主体本身。

source: This method is often used for testing hypertext links for validity, accessibility, and recent modification.
zh_cn: 此方法通常用于测试超文本链接的有效性，可访问性和最近的修改。

source: This method takes as a parameter the item emitted by the Observable.
zh_cn: 此方法将 Observable 发射的项作为参数。

source: This module adds the minimum classes to RxJava that make writing reactive components in Android applications easy and hassle-free.
zh_cn: 该模块为 RxJava 添加了最小类，使得在 Android 应用程序中编写响应组件变得轻松无忧。

source: This negotiation is based on the computer science concept of co-routines (I call you, you call me).
zh_cn: 这个协商是基于计算机科学的 co-routines (译注：协程？)概念(我调用你，你调用我)。

source: This operator in its parameterless form reintroduces an unbounded buffer between the upstream source and the downstream operator.
zh_cn: 此操作符以无参数形式在上游源和下游操作符之间重新引入无边界缓冲区。

source: This operator is useful when one can safely ignore values from a source (such as mouse moves or current GPS location signals) as there will be more up-to-date values later on.
zh_cn: 当可以安全地忽略来自源的值(例如鼠标移动或当前 GPS 位置信号)时，此操作符非常有用，因为稍后会有更多的最新值。

source: This overload calls a (shared) action in case an overflow happens.
zh_cn: 如果发生溢出，此重载会调用(共享)操作。

source: This overload is actually more useful as it let's one define what to do in case the capacity has been reached.
zh_cn: 这种重载实际上更有用，因为我们可以定义在达到容量时要做什么。

source: This page explains what the reactive pattern is and what Observables and observers are (and how observers subscribe to Observables).
zh_cn: 这个页面解释了什么是响应模式(reactive pattern)？以及什么是可观察对象(Observables)和观察者(observers)？(以及观察者如何订阅 Observables)。

source: This page first lists what could be considered the “core” operators in ReactiveX, and links to pages that have more in-depth information on how these operators work and how particular language-specific ReactiveX versions have implemented these operators.
zh_cn: 该页面首先列出了可以被视为 ReactiveX 中的“核心”操作符的内容，以及指向这些页面的链接，这些页面具有关于这些操作符如何工作以及特定语言特定的 ReactiveX 版本如何实现这些操作符的更深入信息。

source: This page uses Groovy-like pseudocode for its examples, but there are ReactiveX implementations in many languages.
zh_cn: 此页面使用类似 Groovy 的伪代码作为示例，但在许多语言中都有 ReactiveX 实现。

source: This paper describes a "superset" of operations that can be applied to URI.
zh_cn: 本文描述了可以应用于 URI 的操作的“超集”。
